"""
تنظیمات اتصال به سرویس هوش مصنوعی.
این تنظیمات شامل بخش سرویس اصلی، سرویس نام‌گذاری (ارزان) و سرویس جایگزین (Groq) است.
"""

# ==========================================
# 1. تنظیمات عمومی (کلید و آدرس سرور)
# ==========================================
BASE_URL = "https://api.gapgpt.app/v1"
API_KEY = "YOUR_API"

# ==========================================
# 2. مدل‌های در دسترس برای گفتگو (سرویس اصلی)
# ==========================================
AVAILABLE_MODELS = {
    "Deepseek": "deepseek-v4-flash",
    "GPT": "gpt-5.6-luna",
    "Gemma": "gemma-3-27b-it",
    "Gemini" : "gemini-3.1-flash-lite",
    "Qwen" : "qwen3-235b-a22b",
    "Grok" : "grok-4.3"    
}

# ==========================================
# 3. تنظیمات سرویس ارزان (فقط برای تولید نام و رنگ)
# ==========================================
CHEAP_BASE_URL = "https://api.gapgpt.app/v1"
CHEAP_API_KEY = "YOUR_API"
CHEAP_MODEL_NAME = "gemma-3-27b-it"

# ==========================================
# 4. تنظیمات سرویس جایگزین (Groq Fallback)
# ==========================================
GROQ_API_KEY = "YOUR_API"
GROQ_MODEL_NAME = "openai/gpt-oss-120b"